Repository: nickapos/myBill
Catalog: src/main/resources/i18n/i18n_myBillUIBundle-*.po
Languages: cs

# billsUI.jMenuItem4.text
source: Manage Categories
cs: Správa kategorií

# billsUI.jMenu2.text
source: About
cs: O programu

# billsUI.aboutMenuItem.text
source: About
cs: O programu

source: Report Parameters:
cs: Parametry výkazu:

source: Date of Issue (YYYY-MM-DD)
cs: Datum vystavení (RRRR-MM-DD)

source: Text Reports
cs: Textové výkazy

# billsUI.companyRetrieveButton.text
source: Retrieve
cs: Získat

# billsUI.companyDetailsGoButton.text
source: Go!
cs: Přejít!

source: Reports
cs: Výkazy

source: Save report as csv
cs: Uložit výkaz jako csv

# billsUI.jMenu5.text
source: Import
cs: Importovat

source: Operations
cs: Operace

# billsUI.jLabel13.text
source: Action
cs: Činnost

source: Date of payment (YYYY-MM-DD)
cs: Datum platby (RRRR-MM-DD)

# billsUI.jLabel4.text
source: Amount
cs: Částka

# billsUI.billRetrieveButton.text
source: Retrieve
cs: Získat

# billsUI.billGoButton.text
source: Go!
cs: Přejít!

source: Insert/Edit Income
cs: Vložit/Upravit příjem

# billsUI.reportButton.text
source: Go
cs: Přejít

source: Validate AFM/VAT
cs: Ověřit AFM/DPH

source: Tools
cs: Nástroje

source: Quit
cs: Ukončit

# billsUI.executeSqlMenuItem.text
source: Execute Sql
cs: Spustit Sql

# billsUI.jLabel1.text
source: Company Name
cs: Název firmy

source: EmptyDatabase
cs: PrázdnáDatabáze

source: EmptyDB
cs: PrázdnáDB

source: Export CSV By Year
cs: Exportovat CSV podle roku

# billsUI.incomeGoButton.text
source: Go
cs: Přejít

# billsUI.jLabel8.text
source: Action
cs: Činnost

source: Bill Id
cs: Id faktury

# billsUI.incomeRetrieveButton.text
source: Retrieve
cs: Získat

source: myBill
cs: mojeFaktura

source: Insert/Edit Bill
cs: Vložit/Upravit fakturu

# billsUI.jLabel15.text
source: Amount
cs: Částka

source: Date (YYYY-MM-DD)
cs: Datum (RRRR-MM-DD)

# billsUI.jLabel17.text
source: Company Name
cs: Název firmy

# billsUI.jLabel16.text
source: Income ID
cs: ID příjmu

source: Export Database
cs: Exportovat databázi

source: Export CSV
cs: Exportovat CSV

source: Import DB Tables
cs: Importovat tabulky DB

source: Export
cs: Exportovat

source: Company Tax Service ID (AFM)
cs: ID daňové služby společnosti (AFM)

# billsUI.jLabel12.text
source: Company Name
cs: Název firmy

# billsUI.jLabel18.text
source: Category
cs: Kategorie

# billsUI.jLabel5.text
source: Action
cs: Činnost

source: Insert/Edit Company
cs: Vložit/Upravit společnost

source: Company Id
cs: ID společnosti

# ExecuteSqlWindow.executeButton.text
source: Execute
cs: Spustit

# ExecuteSqlWindow.title
source: Execute Sql
cs: Spustit Sql

source: Use only create,insert,delete,update,drop commands. Be careful
cs: Používejte pouze příkazy create,insert,delete,update,drop. Buďte opatrní!

# ExportCSVByYear.title
source: Extract CSV by year
cs: Extrahovat CSV podle roku

# ExportCSVByYear.validateButton.text
source: Extract
cs: Extrahovat

source: Please select the year of the records to be extracted
cs: Vyberte prosím rok z kterého mají být výkazy extrahovány

source: Validate AFM
cs: Ověřit AFM

source: Result
cs: Výsledek

source: Validate
cs: Ověřit

source: Please type in the AFM or VAT
cs: Zadejte prosím AFM nebo DPH

source: Something went wrong, please try again!
cs: Něco se pokazilo, zkuste to prosím znovu!

source: The database engine and the application will shutdown!
cs: Jádro databáze a aplikace budou vypnuty!

source: All the database content is going to be deleted!
cs: Veškerý obsah databáze bude smazán!

source: The database is not Empty. I will do nothing!
cs: Databáze není prázdná! Nice nebude provedeno!

source: Insert
cs: Vložit

source: Edit
cs: Upravit

source: Delete
cs: Smazat

source: Companies
cs: Firmy

source: Bills
cs: Výkazy

source: Expenses per company for all years
cs: Náklady za společnost po všechny roky

source: Expenses per company by year
cs: Náklady za společnost po roce

source: Expenses per month for a year
cs: Náklady na měsíc za rok

source: Income
cs: Příjem

source: Income for all years
cs: Příjem za všechny roky

source: Income by year
cs: Příjem za rok

source: Income per month for a year
cs: Příjem za měsíc na rok

source: (Income-Expenses)/Month for a year
cs: (Příjmy-Výdaje)/Měsíc za rok

source: Expenses per category for all years
cs: Výdaje za kategorii za všechny roky

source: Expenses per category per year
cs: Výdaje za kategorii za rok

source: Foreign Currency
cs: Cizí měna

source: (Check to Enable)
cs: (Zaškrtněte pro povolení)

source: Exchange Rates Table
cs: Tabulka měnových kurzů

source: Retrieve Rates
cs: Cena pro získání

source: Retrieve Flipped Rates
cs: Získat převrácené míry

source: Show Rates
cs: Zobrazit ceny

# ConvertToNewCurrencyFrame.executeButton.text
source: Execute
cs: Spustit

source: Use this form to convert all records to a new currency.
cs: Tento formulář použijte k převedení všech záznamů na novou měnu.

source: Convert all records to new currency
cs: Převést všechny záznamy na novou měnu

source: Insert currency exchange rate
cs: Vložte směnný kurz

source: Present exchange rates
cs: Současné směnné kurzy

source: Change db currency
cs: Změnit měnu db

source: Error in Bill Insertion
cs: Chyba při vkládání účtu

source: Error in Company Insertion
cs: Chyba při vkládání společnosti

source: Error in Income Insertion
cs: Chyba při vkládání příjmu

source: Please select the period of the records to be extracted
cs: Prosím zvolte období záznamů pro extrakci

# ExportCSVByPeriod.validateButton.text
source: Extract
cs: Extrahovat

# ExportCSVByPeriod.title
source: Extract CSV by year
cs: Extrahovat CSV podle roku

source: End Period
cs: Konečné období

source: Start Period
cs: Počáteční období

source: Choose the start date of the period
cs: Zvolte počáteční datum období

source: Choose the end date of the period
cs: Zvolte konečné datum období

source: Export Csv By Period
cs: Exportovat Csv podle období

source: Company ID
cs: ID společnosti

source: Company Name
cs: Název společnosti

source: Company Afm
cs: Společnost Afm

source: Category
cs: Kategorie

source: Report Companies
cs: Nahlásit společnosti

source: Bill ID
cs: ID účtu

source: Date of Issue
cs: Datum vystavení

source: Date of Payment
cs: Datum platby

source: Price
cs: Cena

source: Report Bills
cs: Nahlásit účty

source: Report Total expenses Per Company
cs: Nahlásit celkové náklady za společnost

source: Amount
cs: Množství

source: Percentage
cs: Procento

source: AFM/VAT
cs: AFM/DPH

source: Report Total Yearly (
cs: Nahlásit celkové roční (

source: )expenses Per Company
cs: ) náklady za společnost

source: Report Total expenses Per Year (
cs: Nahlásit celkové náklady za rok (

source: Month
cs: Měsíc

source: Income ID
cs: ID příjmu

source: Report Income
cs: Nahlásit příjem

source: Report Total Income
cs: Nahlásit celkový příjem

source: Report expenses per category for all years
cs: Nahlásit náklady za kategorii za všechny roky

source: Report Category expenses Per Year (
cs: Nahlásit náklady kategorie za rok (

source: Report monthly profit/losses for year (
cs: Nahlásit měsíční zisky/ztráty za rok (

source: Report monthly income for year (
cs: Nahlásit měsíční příjem za rok (

source: Months
cs: Měsíce

source: Expenses Per Month
cs: Náklady za měsíc

source: Profit or Loss Per Month
cs: Zisk nebo ztráty za měsíc

source: Company Names
cs: Názvy společností

source: Compare with year
cs: Porovnat s rokem

source: year
cs: rok

source: Compare expenses/category of two years
cs: Porovnat náklady/kategorie za dva roky

source: Currency
cs: Měna

source: One euro value in currency
cs: Hodnota jednoho eura ve měně

source: Waiting for data download to complete. Please press the button again in a few seconds!
cs: Čekání na dokončení stažení dat. Prosím stiskněte znovu tlačítko za pár vteřin!

source: Value of one currency coin in euro
cs: Hodnota jedné mince měny v eurech

source: Calculate amortization
cs: Vypočítat amortizaci

source: per month
cs: za měsíc

source: Present transactions per Company
cs: Současné převody za společnost

# PresentTransactionsPerCompany.goButton.text
source: Go!
cs: Přejít!

source: Company
cs: Společnost

source: Transaction Type
cs: Typ převodu

source: Present Transactions Per Company
cs: Současné převody za společnost

source: Date of payment:
cs: Datum platby:

source: Amount:
cs: Částka:

source: Number of records converted :
cs: Počet převedených záznamů:

source: Number of expenses records converted :
cs: Počet převedených záznamů nákladů:

source: income records converted :
cs: záznamů příjmu převedeno :

# billsUI.jMenuItem9.text
source: Merge Categories
cs: Sloučit kategorie

# MergeCategoriesFrame.progressLabel.text
source: Merged:
cs: sloučeno:

# MergeCategoriesFrame.goButton.text
source: Go!
cs: Přejít!

# MergeCategoriesFrame.jLabel2.text
source: With
cs: S

# MergeCategoriesFrame.title
source: Merge Categories
cs: Sloučit kategorie

source: Merge Category
cs: Sloučit kategorii

# ManageCategoriesFrame.goButton.text
source: Go!
cs: Přejít!

# ManageCategoriesFrame.retrieveCategoryButton.text
source: Retrieve
cs: Získat

# ManageCategoriesFrame.title
source: Manage Categories
cs: Správa kategorií

# ManageCategoriesFrame.jLabel2.text
source: Category
cs: Kategorie

# ManageCategoriesFrame.jLabel1.text
source: Action
cs: Činnost

source: Category Name
cs: Název kategorie

source: Merge records of company
cs: Sloučit záznamy společnosti

# MergeCompanyRecordsFrame.progressLabel.text
source: Merged:
cs: sloučeno:

# MergeCompanyRecordsFrame.goButton.text
source: Go!
cs: Přejít!

# MergeCompanyRecordsFrame.jLabel2.text
source: With
cs: S

source: Merge Company Records
cs: Sloučit záznamy společnosti

source: Merge Operations
cs: Operace sloučení

source: Merge Expenses Companies Records
cs: Sloučit záznamy nákladů společnosti

source: Number of records
cs: Počet záznamů

# ImportPaypalRecordsFrame.jTextField1.text
source: jTextField1
cs: jTextovéPole1

source: Select csv file
cs: Vybrat soubor csv

source: Select companies category
cs: Vyberte kategorii společností

source: Import paypal records
cs: Importovat záznamy paypal

source: Welcome to the import Paypal records function
cs: Vítejte ve funkci importu záznamů Paypal

source: Records imported
cs: Záznamy importovány

source: Import expenses records
cs: Importovat záznamy nákladů

source: Import income records
cs: Importovat záznamy příjmů

# ImportPaypalRecordsFrame.importRecordsButton.text
source: Import
cs: Importovat

# billsUI.jLabel22.text
source: Comment
cs: Komentář

# billsUI.jLabel23.text
source: Comment
cs: Komentář

source: Comment
cs: Komentář

# CalculateAmortizationFrame.jTextField1.text
source: jTextField1
cs: jTextovéPole1

source: Amortization Table
cs: Tabulka amortizací

source: Please insert the payoff period (months)
cs: Prosím zadejte období výplaty (měsíce)

source: Result:
cs: Výsledek:

source: Calculate
cs: Vypočítat

source: Please insert the interest rate without the % sign
cs: Zadejte prosím úrokovou sazbu bez znaménka %

source: Please insert the amount
cs: Prosím zadejte množství

source: Please select the payoff frequency
cs: Prosím zadejte četnost výplaty

source: Calculate Amortization
cs: Vypočítat amortizaci

source: No
cs: Ne

source: instalment
cs: splátka

source: inst capital
cs: úrok z kapitálu

source: inst interest
cs: úrok splátky

source: Total Interest paid:
cs: Celkový zaplacený úrok:

source: Total Capital paid:
cs: Celkem zaplacený úrok

source: Amount:
cs: Částka:

source: Duration:
cs: Trvání:

source: Interest Rate:
cs: Úroková sazba:

source: Frequency:
cs: Četnost:
