Repository: nickapos/myBill
Catalog: i18n/i18n_myBillUIBundle-*.po
Languages: si

# billsUI.jMenuItem4.text
source: Manage Categories
si: ප්‍රවර්ග කළමනාකරණය

# billsUI.jMenu2.text
source: About
si: මේ ගැන

# billsUI.aboutMenuItem.text
source: About
si: මේ ගැන

source: Report Parameters:
si: වාර්ථා කරන්න

source: Date of Issue (YYYY-MM-DD)
si: නිකුත් කළ දිනය (වසර-මාසය -දිනය)

source: Text Reports
si: වාර්තා

# billsUI.companyRetrieveButton.text
source: Retrieve
si: ලබාගන්න

# billsUI.companyDetailsGoButton.text
source: Go!
si: යන්න

source: Reports
si: වාර්තා

source: Save report as csv
si: වාර්තා csv එකක් ලෙස සුරකින්න.

# billsUI.jMenu5.text
source: Import
si: ආයාත කරන්න

source: Operations
si: ක්‍රියාකාරකම්

# billsUI.jLabel13.text
source: Action
si: ක්‍රීයාව

source: Date of payment (YYYY-MM-DD)
si: ගෙවීම් සිදුකළ දිනය (වසර-මාසය-දිනය)

# billsUI.jLabel4.text
source: Amount
si: ප්‍රමාණය

# billsUI.billRetrieveButton.text
source: Retrieve
si: ලබාගන්න

# billsUI.billGoButton.text
source: Go!
si: යන්න

source: Insert/Edit Income
si: එකතු කරන්න/ආදායම වෙනස් කරන්න

# billsUI.reportButton.text
source: Go
si: යන්න

source: Validate AFM/VAT
si: තහවුරැ කරන්න AFM/VAT

source: Tools
si: මෙවලම්

source: Quit
si: ඉවත් වෙන්න

# billsUI.executeSqlMenuItem.text
source: Execute Sql
si: කියා කරවන්න Sql

# billsUI.jLabel1.text
source: Company Name
si: ආයතනයේ නම

source: EmptyDatabase
si: හිස් පරිගණක දත්ත ගබඩාව

source: EmptyDB
si: හිස් පරිගණක දත්ත ගබඩාව

source: Export CSV By Year
si: CSV අවුරැදු වශයෙන් නිර්යාත කරන්න

# billsUI.incomeGoButton.text
source: Go
si: යන්න

# billsUI.jLabel8.text
source: Action
si: ක්‍රියාව

source: Bill Id
si: බිල්පත් අංකය

source: myBill
si: මගේ බිල්පත

source: Insert/Edit Bill
si: බිල්පත එකතු කරන්න/ වෙනස් කරන්න

# billsUI.jLabel15.text
source: Amount
si: ප්‍රමාණය

source: Date (YYYY-MM-DD)
si: දිනය (වසර-මාසය-දිනය)

# billsUI.jLabel17.text
source: Company Name
si: ආයතනයේ නම

# billsUI.jLabel16.text
source: Income ID
si: ආදායම් අංකය

source: Export Database
si: වියදම් දත්ත ගබඩාව

source: Export CSV
si: CSV නිර්යාත කරන්න

source: Import DB Tables
si: දත්ත ගබඩා වගු ආයාත කරන්න

source: Export
si: නිර්යාත කරන්න

source: Company Tax Service ID (AFM)
si: ආයතන බදු සේවා අංකය ((AFM)

# billsUI.jLabel12.text
source: Company Name
si: ආයතනයේ නම

# billsUI.jLabel18.text
source: Category
si: ප්‍රවර්ගය

# billsUI.jLabel5.text
source: Action
si: ක්‍රීයාව

source: Insert/Edit Company
si: ආයතනය එකතු කරන්න/ වෙනස් කරන්න

source: Company Id
si: ආයතන අංකය

# ExecuteSqlWindow.executeButton.text
source: Execute
si: ක්‍රියාකරවන්න

# ExecuteSqlWindow.title
source: Execute Sql
si: කියා කරවන්න Sql

source: Use only create,insert,delete,update,drop commands. Be careful
si: create,insert,delete,update,drop යන නියෝග පමණක් පිළිපදින්න. පරිස්සම් වන්න.

# ExportCSVByYear.title
source: Extract CSV by year
si: CSV වසර අනුව උපුටා ගන්න

# ExportCSVByYear.validateButton.text
source: Extract
si: උපුටාගන්න

source: Please select the year of the records to be extracted
si: උපුටා ගත යුතු වාර්තා වල වසර තෝරාගන්න

source: Validate AFM
si: AFM තහවුරැ කරන්න

source: Result
si: ප්‍රතිඑලය

source: Validate
si: තහවුරැ කරන්න

source: Please type in the AFM or VAT
si: AFM හෝ VAT ලෙස ටයිප් කරන්න

source: Something went wrong, please try again!
si: කිසිවක් වැරදී ඇත. නැවත උත්සහ කරන්න

source: The database engine and the application will shutdown!
si: පරිගණක දත්ත ගබඩාව හා වැඩසටහන නැවතේ.

source: All the database content is going to be deleted!
si: සියලු දත්ත ගබඩා අන්තර්ගතයන් මැතී යාමට සැරසේ

source: The database is not Empty. I will do nothing!
si: පරිගණක දත්ත ගබඩාව හිස් නැත. මා කිසිවක් නොකරමි.

source: Insert
si: ඇතුළත් කරන්න

source: Edit
si: සංස්කරණය කරන්න

source: Delete
si: මකා දමන්න

source: Companies
si: ආයතන

source: Bills
si: බිල්පත්

source: Expenses per company for all years
si: සියලු වර්ෂ සදහා ආයතන වල වියදම්

source: Expenses per company by year
si: ආයතනයේ එක් එක් වර්ෂ සදහා වියදම්

source: Expenses per month for a year
si: වර්ෂයක් සදහා මාසික වියදම්

source: Income
si: ආදායම

source: Income for all years
si: සියලු වර්ෂ සදහා ආදායම

source: Income by year
si: වර්ෂ සදහා ආදායම

source: Income per month for a year
si: වර්ෂයක් සදහා මාසික වියදම

source: (Income-Expenses)/Month for a year
si: (ආදායම-වියදම)/ මාසික

source: Expenses per category for all years
si: සියලු වර්ෂ සදහා එක් එක් පවර්ග වෙනුවෙන් වියදම

source: Expenses per category per year
si: වර්ෂයක් සදහා එක් එක් පවර්ග සදහා වියදම

source: Foreign Currency
si: විදේශ මුදල්

source: (Check to Enable)
si: (කියා කරවීම සදහා පරීක්ෂා කරන්න)

source: Exchange Rates Table
si: විනිමය හුවමාරැ වගුව

source: Retrieve Rates
si: විනිමය අනුපාත ලබාගන්න

source: Retrieve Flipped Rates
si: අනුපාත ලබාගන්න

source: Show Rates
si: විනිමය අනුපාත ලබාගන්න.

# ConvertToNewCurrencyFrame.executeButton.text
source: Execute
si: ක්‍රියාත්මක කරන්න

source: Use this form to convert all records to a new currency.
si: සියලු සටහන් වෙනත් මුදල් වර්ගයක් සදහා පරිවර්තනය කිරීමට මෙම ආකෘතිය භාවිතා කරන්න.

source: Convert all records to new currency
si: සියලු සටහන් වෙනත් මුදල් වර්ගයක් සදහා පරිවර්තනය කරන්න.

source: Insert currency exchange rate
si: විනිමය අනුපාත එකතු කරන්න

source: Present exchange rates
si: වර්තමාන විනිමය අනුපාතය

source: Change db currency
si: දත්ත ගබඩාවේ මුදල් වර්ගය වෙනස් කරන්න.

source: Error in Bill Insertion
si: බිල්පත එකතු කිරීමේදී වරදක් සිදුවී ඇත

source: Error in Company Insertion
si: ආයතනය එකතු කිරීමේදී වරදක් සිදුවී ඇත.

source: Error in Income Insertion
si: ආදායම එකතු කිරීමේදී වරදක් සිදුවී ඇත.

source: Please select the period of the records to be extracted
si: කියාකරවීමට අවශ්‍ය සටහන් වල කාලපරිච්ඡේදය තෝරාගන්න.

# ExportCSVByPeriod.validateButton.text
source: Extract
si: උපුටාගන්න

# ExportCSVByPeriod.title
source: Extract CSV by year
si: CSV වසර අනුව උපුටා ගන්න

source: End Period
si: කාලපරිච්ඡේදය අවසන් කරන්න.

source: Start Period
si: කාලපරිච්ඡේදය ආරම්භ කරන්න.

source: Choose the start date of the period
si: කාලපරිච්ඡේදයේ ආරම්භක දිනය තෝරාගන්න.

source: Choose the end date of the period
si: කාලපරිච්ඡේදයේ අවසාන දිනය තෝරාගන්න.

source: Export Csv By Period
si: කාලපරිච්ඡේදයක් සදහා Csv උපුටා ගන්න.

source: Company ID
si: ආයතන අංකය

source: Company Name
si: ආයතනයේ නම

source: Company Afm
si: ආයතන Afm

source: Category
si: ප්‍රවර්ගය

source: Report Companies
si: ආයතන වාර්තා කරන්න

source: Bill ID
si: බිල්පත් අංකය

source: Date of Issue
si: නිකුත් කළ දිනය

source: Date of Payment
si: ගෙවීම් කළ දිනය

source: Price
si: මිල

source: Report Bills
si: බිල් පිලිබදව වාර්තා කරන්න

source: Report Total expenses Per Company
si: ආයතනයක් සදහා වන මුලු වියදම වාර්තා කරන්න.

source: Amount
si: ප්‍රමාණය

source: Percentage
si: ප්‍රතිශතය

source: Report Total Yearly (
si: වර්ෂ සදහා එකතුව වාර්තා කරන්න(

source: )expenses Per Company
si: ) ආයතනයක් සදහා වන වියදම

source: Report Total expenses Per Year (
si: වර්ෂයක් සදහා මුලු වියදම වාර්තා කරන්න

source: Month
si: මාසය

source: Income ID
si: ආදායම්ප අංකය

source: Report Income
si: ආදායම වාර්තා කරන්න.

source: Report Total Income
si: මුලු ආදායම වාර්තා කරන්න.

source: Report expenses per category for all years
si: සියලුම වර්ෂ සදහා එක් එක් පවර්ග වල වියදම වාර්තා කරන්න.

source: Report Category expenses Per Year (
si: වර්ෂයක් සදහා පවර්ග වල වියදම වාර්තා කරන්න(

source: Report monthly profit/losses for year (
si: වර්ෂයක් සදහා ලාබය/හානිය වාර්තා කරන්න

source: Report monthly income for year (
si: වර්ෂයක් සදහා මාසික ආදායම වාර්තා කරන්න

source: Months
si: මාසය

source: Expenses Per Month
si: මාසයක් සදහා වියදම

source: Profit or Loss Per Month
si: මාසයක් සදහා ලාබය හෝ හානිය

source: Company Names
si: ආයතන වල නම්

source: Compare with year
si: වර්ෂය අනුව සසදන්න

source: year
si: වසර

source: Compare expenses/category of two years
si: වසර 2ක් සදහා වියදම් සසදන්න.

source: Currency
si: මුදල්

source: One euro value in currency
si: යුරෝ අගය මුදල් ඒකකයෙන්

source: Waiting for data download to complete. Please press the button again in a few seconds!
si: දත්ත භාගත වන තුරැ සිටින්න. තත්පර කිහිපයකින් පසු නැවත බොත්තම ඔබන්න.

source: Value of one currency coin in euro
si: එක් කාසියක යුරෝ වටිනාකම

source: Calculate amortization
si: කමක්ෂය ගණනය කරන්න.

source: per month
si: මාසික

source: Present transactions per Company
si: ආයතනයක වර්තමාන හුවමාරැ තත්වය

# PresentTransactionsPerCompany.goButton.text
source: Go!
si: යන්න

source: Company
si: ආයතනය

source: Transaction Type
si: ගනුදෙනු වර්ගය

source: Present Transactions Per Company
si: ආයතනයක වර්තමාන හුවමාරැ තත්වය

source: Date of payment:
si: ගෙවීම් කළ දිනය

source: Amount:
si: අගය

source: Number of records converted :
si: පරිවර්තනය කළ සටහන් ගණන

source: Number of expenses records converted :
si: පරිවර්තනය කළ වියදම් සටහන් ගණන

source: income records converted :
si: පරිවර්තනය කළ ආදායම් සටහන් ගණන

# billsUI.jMenuItem9.text
source: Merge Categories
si: ඒකාබද්ධ කල පවර්ග

# MergeCategoriesFrame.progressLabel.text
source: Merged:
si: ඒකාබද්ධ කළ

# MergeCategoriesFrame.goButton.text
source: Go!
si: යන්න

# MergeCategoriesFrame.jLabel2.text
source: With
si: සමග

# MergeCategoriesFrame.title
source: Merge Categories
si: ඒකාබද්ධ කල පවර්ග

source: Merge Category
si: පවර්ග ඒකාබද්ධ කරන්න

# ManageCategoriesFrame.goButton.text
source: Go!
si: යන්න

# ManageCategoriesFrame.retrieveCategoryButton.text
source: Retrieve
si: ලබාගන්න

# ManageCategoriesFrame.title
source: Manage Categories
si: ප්‍රවර්ග කළමනාකරණය

# ManageCategoriesFrame.jLabel2.text
source: Category
si: ප්‍රවර්ගය

# ManageCategoriesFrame.jLabel1.text
source: Action
si: ක්‍රීයාව

source: Category Name
si: ප්‍රවර්ග නාමය

source: Merge records of company
si: ආයතනයේ ඒකාබද්ධ කළ සටහන්

# MergeCompanyRecordsFrame.progressLabel.text
source: Merged:
si: ඒකාබද්ධ කළ

# MergeCompanyRecordsFrame.goButton.text
source: Go!
si: යන්න

# MergeCompanyRecordsFrame.jLabel2.text
source: With
si: සමග

source: Merge Company Records
si: ආයතන සටහන් ඒකාබද්ධ කරන්න.

source: Merge Operations
si: කියාකාරකම් ඒකාබද්ධ කරන්න.

source: Merge Expenses Companies Records
si: ආයතනයේ වියදම් සටහන් ඒකාබද්ධ කරන්න.

source: Number of records
si: සටහන් ගණන

source: Select csv file
si: csv ගොනුව තෝරාගන්න

source: Select companies category
si: ආයතන වර්ගය තෝරා ගන්න.

source: Import paypal records
si: paypal සටහන් ආයාත කරන්න.

source: Welcome to the import Paypal records function
si: paypal සටහන් ආයාත කිරීමේ කියාවට පිළිගනිමු

source: Records imported
si: සටහන් ආයාත කරන ලදී.

source: Import expenses records
si: වියදම් සටහන් ආයාත කරන්න

source: Import income records
si: ආදායම් සටහන් ආයාත කරන්න

# ImportPaypalRecordsFrame.importRecordsButton.text
source: Import
si: ආයාත කරන්න

# billsUI.jLabel22.text
source: Comment
si: අදහස් දැක්වීම

# billsUI.jLabel23.text
source: Comment
si: අදහස් දැක්වීම

source: Comment
si: අදහස් දැක්වීම

source: Amortization Table
si: කමක්ෂය වගුව

source: Please insert the payoff period (months)
si: ගෙවා අවසන් කරන ලද කාල පරිච්ඡේද ඇතුල් කරන්න.

source: Result:
si: ප්‍රථිපලය:

source: Calculate
si: ගණනය කරන්න

source: Please insert the interest rate without the % sign
si: විනිමය අනුපාතය % ලකුණ නොමැතිව ඇතුල් කරන්න.

source: Please insert the amount
si: අගය ඇතුල් කරන්න.

source: Please select the payoff frequency
si: ගෙවා අවසන් කරන ලද සංඛයාතය ඇතුල් කරන්න.

source: Calculate Amortization
si: කමක්ෂය ගණනය කරන්න.

source: No
si: නැත

source: instalment
si: වාරිකය

source: rem capital
si: rem පාග්ධනය

source: inst capital
si: inst පාග්ධනය

source: inst interest
si: inst පොලිය

source: Total Interest paid:
si: ගෙවන ලද මුලු පොලිය

source: Total Capital paid:
si: ගෙවන ලද මුලු පාග්ධනය

source: Amount:
si: අගය

source: Duration:
si: කාලසීමාව:

source: Interest Rate:
si: පොලී අනුපාතය

source: Frequency:
si: සංඛ්‍යාතය
